app/controllers/pokemons_controller.rb

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 3]]
UPDATE "pokemons" SET "trainer_id" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["trainer_id", 5], ["updated_at", "2015-10-30 04:50:24.433432"], ["id", 3]]
---
  def capture
    @pokemon = Pokemon.find(params[:id])
    @pokemon.trainer = current_trainer
    @pokemon.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", nil]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 90], ["updated_at", "2015-10-30 07:43:23.810595"], ["id", 1]]
---
  def damage
    @pokemon = Pokemon.find(params[:id])
    @pokemon.health -= 10
    @pokemon.save

SELECT  "pokemons".* FROM "pokemons" WHERE "pokemons"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "pokemons" SET "health" = ?, "updated_at" = ? WHERE "pokemons"."id" = ?  [["health", 100], ["updated_at", "2015-10-30 19:34:00.630770"], ["id", 1]]
---
  def heal
    @pokemon = Pokemon.find(params[:id])
    @pokemon.health += 10
    @pokemon.save

INSERT INTO "pokemons" ("name", "level", "health", "trainer_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "asdk;jaskd3"], ["level", 1], ["health", 100], ["trainer_id", 5], ["created_at", "2015-10-30 20:43:11.456093"], ["updated_at", "2015-10-30 20:43:11.456093"]]
---
  def create
    @pokemon = Pokemon.new(name:params[:pokemon][:name], level:1, health:100, trainer:current_trainer)
    if @pokemon.save